# Regiment

### Introduction:

Special thanks to: http://chrisalbon.com/ for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Create the DataFrame with the following values:

In [2]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### Step 3. Assign it to a variable called regiment.
#### Don't forget to name each column

In [3]:
regiment = pd.DataFrame(raw_data)

In [4]:
regiment

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

### Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [6]:
regiment.groupby('regiment')['preTestScore'].mean()['Nighthawks']

15.25

### Step 5. Present general statistics by company

In [7]:
regiment['company'].describe()

count      12
unique      2
top       1st
freq        6
Name: company, dtype: object

In [11]:
regiment.groupby('company').describe(include = 'all').T

company                      1st         2nd
regiment      count            6           6
              unique           3           3
              top     Nighthawks  Nighthawks
              freq             2           2
              mean           NaN         NaN
              std            NaN         NaN
              min            NaN         NaN
              25%            NaN         NaN
              50%            NaN         NaN
              75%            NaN         NaN
              max            NaN         NaN
name          count            6           6
              unique           6           5
              top         Miller         Ali
              freq             1           2
              mean           NaN         NaN
              std            NaN         NaN
              min            NaN         NaN
              25%            NaN         NaN
              50%            NaN         NaN
              75%            NaN         NaN
              max            NaN         NaN
preTestScore  count          6.0         6.0
              unique         NaN         NaN
              top            NaN         NaN
              freq           NaN         NaN
              mean      6.666667        15.5
              std       8.524475   14.652645
              min            2.0         2.0
              25%            3.0        2.25
              50%            3.5        13.5
              75%            4.0       29.25
              max           24.0        31.0
postTestScore count          6.0         6.0
              unique         NaN         NaN
              top            NaN         NaN
              freq           NaN         NaN
              mean     57.666667        67.0
              std      27.485754   14.057027
              min           25.0        57.0
              25%          34.25       58.25
              50%           66.0        62.0
              75%           70.0        68.0
              max           94.0        94.0

### Step 6. What is the mean of each company's preTestScore?

In [12]:
regiment.groupby('company')['preTestScore'].mean()

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

### Step 7. Present the mean preTestScores grouped by regiment and company

In [14]:
pd.DataFrame(regiment.groupby(['regiment','company'])['preTestScore'].mean())

                    preTestScore
regiment   company
Dragoons   1st               3.5
           2nd              27.5
Nighthawks 1st              14.0
           2nd              16.5
Scouts     1st               2.5
           2nd               2.5

### Step 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [16]:
regiment.groupby(['regiment','company'])['preTestScore'].mean().unstack()

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

### Step 9. Group the entire dataframe by regiment and company

In [19]:
regiment.groupby(['regiment','company']).mean()

                    preTestScore  postTestScore
regiment   company
Dragoons   1st               3.5           47.5
           2nd              27.5           75.5
Nighthawks 1st              14.0           59.5
           2nd              16.5           59.5
Scouts     1st               2.5           66.0
           2nd               2.5           66.0

### Step 10. What is the number of observations in each regiment and company

In [25]:
regiment.groupby(['regiment','company']).size()
#or
#regiment.groupby(['regiment','company']).count()

regiment    company
Dragoons    1st        2
            2nd        2
Nighthawks  1st        2
            2nd        2
Scouts      1st        2
            2nd        2
dtype: int64

In [ ]:
name city 
a     aaa
b     bbb
c     aaa
d     bbb 
e     ccc
f     aaa


value_counts()
aaa - 3
bbb - 2
ccc - 1

count()
6

In [27]:
regiment['company'].value_counts()

1st    6
2nd    6
Name: company, dtype: int64

In [28]:
regiment['company'].count()

12

### Step 11. Iterate over a group and print the name and the whole data from the regiment

In [31]:
for name, group in regiment.groupby('regiment'):
    print("Name: ",name)
    print("group: ", group)

Name:  Dragoons
group:     regiment company    name  preTestScore  postTestScore
4  Dragoons     1st   Cooze             3             70
5  Dragoons     1st   Jacon             4             25
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57
Name:  Nighthawks
group:       regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
Name:  Scouts
group:     regiment company   name  preTestScore  postTestScore
8    Scouts     1st  Sloan             2             62
9    Scouts     1st  Piger             3             70
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70